---
type: ArgumentException
namespace: Autodesk.Revit.Exceptions
version: 2024
members: 3
tags: [revit-api, class]
---

# ArgumentException

`Autodesk.Revit.Exceptions.ArgumentException` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetObjectData | — | `public override void GetObjectData ( SerializationInfo info , StreamingContext context )` |
| Property | Message | — | `public override string Message { get ; }` |
| Property | ParamName | — | `public string ParamName { get ; }` |